#Напишите скрипт, который по введенному пользователем числу от 1 до 12, будет выводить на экран сообщение в виде названия месяца и времени года. Если пользователь введет недопустимое число, программа должна выдавать сообщение об ошибке.
#№1#
a = float(input())
b = float(input())
if b == 0:
    print("На ноль делить нельзя")
else:
    c = a/b
    print(c)
#№2#
a = float(input())
b = 0
if a > 20:
    b = round(a*0.35, 2)
c = a-b
print("Итоговая стоимость:", round(c, 2),
      "Cкидка:", b)
#№3#
a = input("Введите номер месяца от 1 до 12: ")
if (a == 12 or a <= 2):
    print("Зима")
elif (a > 2 or a <= 5):
    print("Весна")
elif (a > 5 or a <= 8):
    print("Лето")
elif (a > 8 or a <= 11):
    print("Осень")
else:
    print("Ошибка")

